// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

// Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.
// 1. Напиши переменную промт
// 2. Написать какие страны могут входить в переменную через свитч
// 3. Пропиши нижний регистр
// 4. Написать если нету доставки
let country;
let price;
const message = prompt('Введите вашу страну');
switch (message.toLocaleLowerCase()) {
  case 'китай':
    country = 'Китай';
    price = 100;
    alert(`Доставка в ${country} буде коштувати ${price} кредитів`);
    break;
  case 'чилі':
    country = 'Чилі';
    price = 250;
    alert(`Доставка в ${country} буде коштувати ${price} кредитів`);
    break;
  case 'австралія':
    country = 'Австралія';
    price = 170;
    alert(`Доставка в ${country} буде коштувати ${price} кредитів`);
    break;
  case 'індія':
    country = 'Індія';
    price = 80;
    alert(`Доставка в ${country} буде коштувати ${price} кредитів`);
    break;
  case 'ямайка':
    country = 'Ямайка';
    price = 120;
    alert(`Доставка в ${country} буде коштувати ${price} кредитів`);
    break;
  default:
    alert('У вашій країні доставка недоступна');
}
